# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'

# tap 'nicoverbruggen/homebrew-cask'
# tap 'stripe/stripe-cli'

# Binaries
# brew 'awscli'
# brew 'coreutils' # Those that come with macOS are outdated
# brew 'mackup'

cask '1password'
cask 'raycast'
cask 'visual-studio-code'

cask 'radarr'
cask 'sonarr'
cask 'prowlarr'
cask 'sabnzbd'

brew 'carbon-copy-cloner'
brew 'docker'
brew 'dropbox'
brew 'fantastical'
cask 'appcleaner'

cask 'asana'
brew 'herd'
brew 'dbngin'
cask 'nordvpn'
cask 'private-internet-access'
cask 'firefox'
cask 'imageoptim'
brew 'svgo'

cask 'the-unarchiver'
cask 'transmission'



# Mac App Store
brew 'mas' 

mas 'ColorSlurp', id: 1287239339
mas 'DaisyDisk', id: 411643860
mas 'Hidden Bar', id: 1452453066
mas "ImageSize - Resize Photos", id: 1197449714
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas "Transmit", id: 1436522307
mas "Xcode", id: 497799835






# Rogue Amoeba
# brew install --cask audiohijack
# brew install --cask farrago
# brew install --cask soundsource

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'

# brew 'gifsicle'

# Development

# brew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'colima'
# brew 'composer'
# brew 'ddev'
# brew 'imagemagick'
# brew 'meilisearch'
# brew 'mysql'
# brew 'mysql@5.7'
# brew 'nginx'
# brew 'node'
# brew 'redis'
# brew 'yarn'

# Microsoft
# cask 'intune-company-portal'
# cask 'microsoft-outlook'
# cask 'microsoft-teams'

# Apps

# cask '1password-cli'

# cask 'fig'
# cask 'discord'
# cask 'google-chrome'

# cask 'launchbar'
# cask 'little-snitch'

# cask 'loopback'
# cask 'plex-media-server'
# cask 'plex'
# cask 'slack'
# cask 'spotify'
# cask 'launchbar'

# cask 'soundsource'


# Quicklook
# https://github.com/haokaiyang/Mac-QuickLook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'qlstephen'
# cask 'qlvideo'
# cask 'webpquicklook'

# Fonts
# cask 'font-lato'
