# Taps
# tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
# tap 'homebrew/bundle'
# tap 'nicoverbruggen/homebrew-cask'
# tap 'stripe/stripe-cli'

# Binaries
# brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'mackup'
brew 'mas' # Mac App Store manager


# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'colima'
# brew 'composer'
# brew 'docker'
# brew 'ddev'
# brew 'imagemagick'
# brew 'meilisearch'
brew 'mysql'
# brew 'mysql@5.7'
# brew 'nginx'
brew 'node'
# brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'appcleaner'
# cask 'discord'
cask 'fig'
# cask 'firefox'
cask 'google-chrome'
# cask 'imageoptim'
# cask 'loopback'
# cask 'plex-media-server'
cask 'slack'
# cask 'spotify'
# cask 'launchbar'
# cask 'soundsource'
# cask 'the-unarchiver'
# cask 'transmission'
cask 'visual-studio-code'
cask 'little-snitch'
# cask 'zoom'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'qlstephen'
# cask 'qlvideo'
# cask 'webpquicklook'

# Fonts
# cask 'font-lato'

# Mac App Store
# mas 'Bitwarden', id: 1352778147
# mas 'ColorSlurp', id: 1287239339
# mas 'DaisyDisk', id: 411643860
mas 'Magnet', id: 441258766
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas "Transmit", id: 1436522307
# mas "Xcode", id: 497799835
