# Taps
#tap 'homebrew/cask'
#tap 'homebrew/cask-fonts'
#tap 'homebrew/cask-versions'
#tap 'homebrew/bundle'
#tap 'nicoverbruggen/homebrew-cask'
#tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
#brew 'bash' # Latest Bash version
#brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
#brew 'ffmpeg'
#brew 'gh'
#brew 'git'
#brew 'grep'
#brew 'httpie'
#brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
#brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'stripe/stripe-cli/stripe'
#brew 'stripe/stripe-mock/stripe-mock'
#brew 'svn' # Needed to install fonts

# Spatie Medialibrary
#brew 'jpegoptim'
#brew 'optipng'
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'slack'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'little-snitch'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
#cask 'font-lato'
#cask 'font-open-sans'
#cask 'font-roboto'
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'

# Mac App Store
mas 'Bitwarden', id: 1352778147
mas 'ColorSlurp', id: 1287239339
mas 'DaisyDisk', id: 411643860
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905